# 1. Введи список, отсортируй его и оставь только уникальные элементы
# Примечание: Уникальные элементы - это элементы, которые появляются только один раз в списке





# 2. Создай список с любыми значениями и выведи первый, средний и последний элементы.






# 3. Представь, что мы пишем программу для банковских карточек. Человек может совершать покупки, пока у него на карте хватает на это денег. В начале программы вводим количество денег, а потом вводим расходы, пока они не превышают баланс на карте. Когда превысили, мы должны получить, сколько успели сделать покупок и сколько осталось денег на карте.






# 4. Напиши программу, которая принимает на вход десятизначное число (например:1234567893) и находит в нём все четные числа.







# 5. Напиши программу, которая вычисляет квадраты чисел от 1 до 10 (использовать цикл while)









# 6. Даны 2 списка:
# a = [4,6,'pу','tell',78]
# b = [44,'hello’,56,'exept’,[‘world’,5.7],3,6]
# Тебе нужно выполнить следующие операции:
# 1. Сложить два списка
# 2. Добавить элемент 6 на 3 позицию.
# 3. Посчитать сколько раз встречается число 6
# 4. Посчитать количество элементов списка
# 5. Вывести 1 элемент вложенного списка












# 7. Создай список, замени первый его элемент на [1, 2, 3], затем в конец списка добавь сумму элементов вложенного списка.

